## missing values are represent
- None
- NaN(not a number)

In [1]:
# Will create a dataset having missing values

import numpy as np
import pandas as pd

In [2]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

In [3]:
data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [4]:
data1.isnull()

    Name  Salary    Age
0  False   False   True
1  False   False  False
2  False    True  False
3   True   False  False

In [5]:
data1.isnull().sum()

Name      1
Salary    1
Age       1
dtype: int64

In [6]:
data1.isna()

    Name  Salary    Age
0  False   False   True
1  False   False  False
2  False    True  False
3   True   False  False

In [7]:
data1.isna().count()
# useless-----> rows count

Name      4
Salary    4
Age       4
dtype: int64

## Case-1:

$fillna$:
- Fill mising value with some number

In [8]:
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [9]:
data1.fillna(5,inplace=True)
# inplace=true

In [10]:
data1

      Name  Salary   Age
0      Ram   100.0   5.0
1   Laxman    90.0  30.0
2  Krishan     5.0  40.0
3        5    95.0  50.0

In [11]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [12]:
# use fillna concept only on specific column
data1['Age']=data1['Age'].fillna(30)

In [13]:
data1

      Name  Salary   Age
0      Ram   100.0  30.0
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

### Case-2:

- Fill missing values by using previous value

In [14]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [15]:
data1.fillna(method='pad',inplace=True)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan    90.0  40.0
3  Krishan    95.0  50.0

### Case-3:

- Fill missing valuses with Next ones

In [16]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [17]:
data1.fillna(method="bfill",inplace=True)
data1

      Name  Salary   Age
0      Ram   100.0  30.0
1   Laxman    90.0  30.0
2  Krishan    95.0  40.0
3      NaN    95.0  50.0

### Case-4:

**Drop values**

In [18]:
# You have a data 100000000
# In that 2%  perecent data has missing values
# ->100-2=98, ->1000-20=980, ->10000-200=9800, ->100000-2000=98000

# ML-----> Data should be high
# data is very less--------> drop the values (not allowed)
# data is very hugs-----> till 5% if you have missing values (drop the data allowed)

In [19]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [20]:
data1.dropna()
# It will check row wise
# if any row has NaN,it will drop that row
# Axis=0-------->rows
# Axis=1---------->columns

     Name  Salary   Age
1  Laxman    90.0  30.0

In [21]:
data1.dropna(axis=0)
# axis =0 means it will drop the rows
# if any row having missing value/null value
# data1.drop(), and data1.dropna(axis=0)   both are same

     Name  Salary   Age
1  Laxman    90.0  30.0

In [22]:
data1.dropna(axis=1)
# axis=1 drop the columns,whose having null values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
data2=data1.iloc[[0,1,2]]
data2

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0

In [24]:
data2.dropna(axis=1)

      Name
0      Ram
1   Laxman
2  Krishan

**Fill the missing values by using Mean-Median-Mode**

- You need to do column wise
- Some columns are numerical and some other columns are categorical
- For categoricalwe cant apply mean and Median
- For Numerical columns apply mean/Median
- For categorical columns apply Mode.

In [25]:
dict1={"Name":["Ram","Laxman","Krishan",np.nan],
      "Salary":[100,90,np.nan,95],
      "Age":[np.nan,30,40,50]}

data1=pd.DataFrame(dict1)
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan     NaN  40.0
3      NaN    95.0  50.0

In [26]:
sal_mean=data1['Salary'].mean()

In [27]:
data1['Salary'].fillna(sal_mean,inplace=True)

In [28]:
data1

      Name  Salary   Age
0      Ram   100.0   NaN
1   Laxman    90.0  30.0
2  Krishan    95.0  40.0
3      NaN    95.0  50.0

In [29]:
age_median=data1['Age'].median()

In [30]:
data1['Age'].fillna(age_median,inplace=True)

In [31]:
data1

      Name  Salary   Age
0      Ram   100.0  40.0
1   Laxman    90.0  30.0
2  Krishan    95.0  40.0
3      NaN    95.0  50.0

In [33]:
data1['Name'].mode()

0    Krishan
1     Laxman
2        Ram
Name: Name, dtype: object